esmjihwankim/BSPWon_nRF52832/gpio_control.h

#ifndef _GPIO_CONTROL_H
#define _GPIO_CONTROL_H


#include "app_timer.h"
#include "ble_nus.h"
#include "app_uart.h"
#include "nrf_drv_timer.h"
#include "nrf_drv_clock.h"
#include "helper.h"

/*
GPIOs for Toggling Event : PIN_1, PIN_2
GPIOs for Cascade Action : LED_PIN_1,LED_PIN_2,LED_PIN_3,LED_PIN_4,LED_PIN_5
*/

#define CONTROL_PIN_1 13
#define CONTROL_PIN_2 14
#define CONTROL_PIN_3 15
#define CONTROL_PIN_4 16

#define CASCADE_PIN_1 0
#define CASCADE_PIN_2 0
#define CASCADE_PIN_3 0
#define CASCADE_PIN_4 0 
#define CASCADE_PIN_5 0 

#define PULSE_PIN_1 0
#define PULSE_PIN_2 0
#define PULSE_PIN_3 0
#define PULSE_PIN_4 0
#define PULSE_PIN_5 0
#define PULSE_PIN_6 0
#define PULSE_PIN_7 0
#define PULSE_PIN_8 0
#define PULSE_PIN_9 0
#define PULSE_PIN_10 0
#define PULSE_PIN_11 0
#define PULSE_PIN_12 0


#define CASCADE_INTERVAL APP_TIMER_TICKS(100)

APP_TIMER_DEF(m_app_timer_id);
void gpio_init(void);
void control_table(ble_nus_evt_t * p_evt);
void led_on(void); 
void led_off(void);
void led_cascade_on(void);
void led_cascade_off(void);
void led_toggle(void);



#endif